########################################
# SHELL, TERMINALE E PRODUTTIVITÀ
########################################

brew 'zsh'       # shell avanzata
brew 'starship'  # prompt shell moderno velocissimo
brew "eza"
brew 'tmux'      # terminal multiplexer per sessioni persistenti
cask 'ngrok'
brew 'fzf'       # fuzzy finder universale
brew 'zoxide'    # cd intelligente tra directory
brew 'eza'       # alternativa moderna a ls
brew 'bat'       # cat moderno con syntax highlighting
brew 'ripgrep'   # ricerca testo velocissima
brew 'fd'        # alternativa moderna a find
brew 'btop'      # monitor risorse sistema
brew 'bottom'    # monitor sistema alternativo
brew 'procs'     # alternativa moderna a ps
brew 'tldr'      # man pages semplificati
brew 'tree'      # visualizza struttura directory
brew 'duf'       # alternativa moderna a df
brew 'dust'      # alternativa moderna a du

########################################
# FONTS
########################################

cask 'font-jetbrains-mono-nerd-font
'
########################################
# UTILITY CLI MODERNE
########################################

brew 'choose'    # alternativa moderna a cut
brew 'sd'        # sostituto moderno di sed
brew 'hyperfine' # benchmark CLI molto preciso
brew 'entr'      # esegue comandi quando file cambiano
brew 'watchexec' # file watcher avanzato
brew 'glow'      # render markdown nel terminale
brew 'jq'        # parser JSON CLI
brew 'xh'        # client HTTP moderno
brew 'httpie'    # client HTTP user-friendly
brew 'curl'      # client HTTP classico
brew 'htop'      # monitoring resources and processes

########################################
# GIT E VERSIONAMENTO
########################################
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'lazygit'
brew 'tig'
brew 'gh'
brew 'mercurial'
brew 'neovim'

########################################
# BUILD SYSTEM E TOOLCHAIN SVILUPPO
########################################
brew 'automake'
brew 'bison'
brew 'cmake'
brew 'meson'
brew 'coreutils'
brew 'gnu-sed'
brew 'gnu-tar'

########################################
# LINGUAGGI E RUNTIME
########################################
brew 'go'
brew 'rust'
brew 'python@3.12'
brew 'pyenv'
brew 'protobuf'

########################################
# DEVOPS, CLOUD E CONTAINER
########################################
brew 'ansible'
brew 'terraform'
brew 'awscli'
brew 'kubectl'
brew 'k9s'
brew 'lazydocker'
brew 'stern'
brew 'grype'
brew 'dive'
brew 's5cmd'

########################################
# NETWORKING E SICUREZZA
########################################
brew 'nmap'
brew 'doggo'
brew 'gping'
brew 'bandwhich'
brew 'socat'
brew 'libpcap'
brew 'nghttp2'
brew 'ssh-copy-id'
brew 'sshpass'
brew 'gnupg'
brew 'libfido2'

########################################
# MEDIA E FILE
########################################
brew 'ffmpeg'
brew 'imagemagick'
brew 'yt-dlp'
brew 'unzip'

########################################
# DATABASE E SERVIZI LOCALI
########################################
brew 'redis'

########################################
# STRUMENTI VARI UTILI
########################################

brew 'hugo'
brew 'libxslt'


########################################
# DOTFILES MANAGEMENT
########################################

brew 'stow'